<?php
/**
 * Есть строка $string = 'яблоко черешня вишня вишня черешня груша яблоко черешня вишня
 * яблоко вишня вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня
 * вишня черешня груша яблоко черешня черешня вишня яблоко вишня вишня черешня черешня груша яблоко черешня вишня';
 * Подсчитайте, сколько раз каждый фрукт встречается в этой строке.
 * Выведите  в виде списка в порядке уменьшения количества:<br><br>


Пример вывода:<br>
яблоко – 12<br>
черешня – 8<br>
груша – 5<br>
слива - 3<br>
 * Created by PhpStorm.
 * User: vladlenov
 * Date: 07.07.17
 * Time: 13:58
 */